# TIME SERIES ANALYSIS

In [47]:
import pandas as pd

In [89]:
df= pd.read_csv("applestock_data.csv")
df.head()

         Date  Close/Last     Volume      Open      High       Low
0  11-03-2020     $110.44  107624400   $109.66   $111.49   $108.73
1  11-02-2020     $108.77  122866900   $109.11   $110.68   $107.32
2  10/30/2020     $108.86  190573500   $111.06   $111.99   $107.72
3  10/29/2020     $115.32  146129200   $112.37   $116.93    $112.2
4  10/28/2020      $111.2  143937800   $115.05   $115.43    $111.1

In [90]:
df.head()

         Date  Close/Last     Volume      Open      High       Low
0  11-03-2020     $110.44  107624400   $109.66   $111.49   $108.73
1  11-02-2020     $108.77  122866900   $109.11   $110.68   $107.32
2  10/30/2020     $108.86  190573500   $111.06   $111.99   $107.72
3  10/29/2020     $115.32  146129200   $112.37   $116.93    $112.2
4  10/28/2020      $111.2  143937800   $115.05   $115.43    $111.1

In [91]:
df["Date"]=pd.to_datetime(df["Date"])

In [92]:
df[' Close/Last'].unique()

array([' $110.44', ' $108.77', ' $108.86', ..., ' $30.265', ' $30.23',
       ' $30.5'], dtype=object)

In [93]:
df.columns

Index(['Date', ' Close/Last', ' Volume', ' Open', ' High', ' Low'], dtype='object')

In [94]:
df[' Close/Last']=df[' Close/Last'].apply(lambda x : float(x.replace(" $","")))

In [59]:
df[' Open']=[i.replace(" $","") for i in df[' Open']]

In [61]:
for i,j in enumerate(df[" High"]):
    df[" High"][i]=j.replace(" $","")

C:\Users\teach\AppData\Local\Temp\ipykernel_9572\1161025351.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[" High"][i]=j.replace(" $","")

In [67]:
df[" Low"][0][2:]

'108.73'

In [74]:
val=[]
def conversion(x):
    for i in x:
        val.append(i[2:])
    return val

In [75]:
a=conversion(df[" Low"])

In [79]:
len(a)

1259

In [80]:
df[" Low"]=a

In [84]:
df.columns=["date","close_price","volume","open_price","high","low"]

In [ ]:
df["close_price"]=df["close_price"].astype("float")
df["open_price"]=df["open_price"].astype("float")

In [87]:
for i in df[["close_price","open_price","high","low"]]:
    df[i]=df[i].astype("float")

In [88]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1259 entries, 0 to 1258
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         1259 non-null   datetime64[ns]
 1   close_price  1259 non-null   float64
 2   volume       1259 non-null   int64
 3   open_price   1259 non-null   float64
 4   high         1259 non-null   float64
 5   low          1259 non-null   float64
dtypes: datetime64[ns](1), float64(4), int64(1)
memory usage: 59.1 KB

In [5]:
df= pd.read_csv("applestock_data.csv",parse_dates=["Date"],index_col="Date")

In [15]:
df.head()

               Close     Volume      Open      High       Low
Date
2020-11-03   $110.44  107624400   $109.66   $111.49   $108.73
2020-11-02   $108.77  122866900   $109.11   $110.68   $107.32
2020-10-30   $108.86  190573500   $111.06   $111.99   $107.72
2020-10-29   $115.32  146129200   $112.37   $116.93    $112.2
2020-10-28    $111.2  143937800   $115.05   $115.43    $111.1

In [9]:
df.columns

Index([' Close/Last', ' Volume', ' Open', ' High', ' Low'], dtype='object')

In [12]:
df.columns=['Close', 'Volume', 'Open', 'High', 'Low']

In [13]:
df.columns

Index(['Close', 'Volume', 'Open', 'High', 'Low'], dtype='object')

In [14]:
def remove_dollar(num):
    return float(num[2:])

In [206]:
for i in df.columns:
    if i =="Volume":
        pass
    else:
        df[i]=df[i].apply(remove_dollar)

In [207]:
df.head()
df["Low"][0]

108.73

In [208]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1259 entries, 2020-11-03 to 2015-11-04
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Close   1259 non-null   float64
 1   Volume  1259 non-null   int64
 2   Open    1259 non-null   float64
 3   High    1259 non-null   float64
 4   Low     1259 non-null   float64
dtypes: float64(4), int64(1)
memory usage: 99.0 KB

In [209]:
for i in df:
    df[i]=df[i].astype("float")

In [75]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 1259 entries, 2020-11-03 to 2015-11-04
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Close   1259 non-null   float64
 1   Volume  1259 non-null   float64
 2   Open    1259 non-null   float64
 3   High    1259 non-null   float64
 4   Low     1259 non-null   float64
dtypes: float64(5)
memory usage: 59.0 KB

In [210]:
df.head()

             Close       Volume    Open    High     Low
Date
2020-11-03  110.44  107624400.0  109.66  111.49  108.73
2020-11-02  108.77  122866900.0  109.11  110.68  107.32
2020-10-30  108.86  190573500.0  111.06  111.99  107.72
2020-10-29  115.32  146129200.0  112.37  116.93  112.20
2020-10-28  111.20  143937800.0  115.05  115.43  111.10

In [211]:
df.index

DatetimeIndex(['2020-11-03', '2020-11-02', '2020-10-30', '2020-10-29',
               '2020-10-28', '2020-10-27', '2020-10-26', '2020-10-23',
               '2020-10-22', '2020-10-21',
               ...
               '2015-11-17', '2015-11-16', '2015-11-13', '2015-11-12',
               '2015-11-11', '2015-11-10', '2015-11-09', '2015-11-06',
               '2015-11-05', '2015-11-04'],
              dtype='datetime64[ns]', name='Date', length=1259, freq=None)

# What is DatetimeIndex? Benefits of it

(1) Partial Date Index: Select Specific Months Data

In [212]:
df["2020-03-30":]

              Close       Volume     Open     High      Low
Date
2020-03-30  63.7025  167976440.0  62.6850  63.8800  62.3500
2020-03-27  61.9350  204216600.0  63.1875  63.9675  61.7625
2020-03-26  64.6100  252560680.0  61.6300  64.6700  61.5900
2020-03-25  61.3800  303602040.0  62.6875  64.5625  61.0750
2020-03-24  61.7200  287531080.0  59.0900  61.9225  58.5750
...             ...          ...      ...      ...      ...
2015-11-10  29.1925  236117600.0  29.2250  29.5175  29.0153
2015-11-09  30.1425  135317160.0  30.2400  30.4525  30.0125
2015-11-06  30.2650  132036440.0  30.2775  30.4525  30.1550
2015-11-05  30.2300  157933600.0  30.4625  30.6725  30.0450
2015-11-04  30.5000  179316240.0  30.7825  30.9550  30.4050

[1107 rows x 5 columns]

In [213]:
df["2019"]

              Close       Volume     Open     High      Low
Date
2019-12-31  73.4125  100990520.0  72.4825  73.4200  72.3800
2019-12-30  72.8800  144238440.0  72.3650  73.1725  71.3050
2019-12-27  72.4500  146371760.0  72.7800  73.4925  72.0300
2019-12-26  72.4775   93336000.0  71.2050  72.4950  71.1750
2019-12-24  71.0675   48478840.0  71.1725  71.2225  70.7299
...             ...          ...      ...      ...      ...
2019-01-08  37.6875  162491640.0  37.3900  37.9550  37.1300
2019-01-07  36.9825  218285760.0  37.1750  37.2075  36.4750
2019-01-04  37.0650  229694600.0  36.1325  37.1375  35.9500
2019-01-03  35.5475  364427360.0  35.9950  36.4300  35.5000
2019-01-02  39.4800  142548280.0  38.7225  39.7125  38.5575

[252 rows x 5 columns]

# Average price of aapl's stock in June, 2017

In [124]:
df["2017-06"].Close.mean()

36.9578409090909

In [125]:
df["2018"]["Open"].median()

46.5725

# (2) Select Date Range

In [126]:
df["2020-01":]

              Close     Volume     Open     High      Low
Date
2020-01-31  77.3775  199588400  80.2325  80.6700  77.0725
2020-01-30  80.9675  126743240  80.1360  81.0225  79.6875
2020-01-29  81.0850  216599720  81.1125  81.9625  80.3450
2020-01-28  79.4225  162233960  78.1500  79.6000  78.0475
2020-01-27  77.2375  161940040  77.5150  77.9425  76.2200
...             ...        ...      ...      ...      ...
2015-11-10  29.1925  236117600  29.2250  29.5175  29.0153
2015-11-09  30.1425  135317160  30.2400  30.4525  30.0125
2015-11-06  30.2650  132036440  30.2775  30.4525  30.1550
2015-11-05  30.2300  157933600  30.4625  30.6725  30.0450
2015-11-04  30.5000  179316240  30.7825  30.9550  30.4050

[1067 rows x 5 columns]

In [215]:
a= df['2017-01-11':'2017-01-03']

              Close       Volume     Open     High      Low
Date
2017-01-11  29.9375  109812520.0  29.6850  29.9825  29.6500
2017-01-10  29.7775   97730640.0  29.6925  29.8450  29.5750
2017-01-09  29.7475  133681160.0  29.4875  29.8575  29.4850
2017-01-06  29.4775  126859280.0  29.1950  29.5400  29.1175
2017-01-05  29.1525   88460400.0  28.9800  29.2160  28.9525
2017-01-04  29.0050   84326480.0  28.9625  29.1275  28.9375
2017-01-03  29.0375  115076880.0  28.9500  29.0825  28.6900

In [128]:

df['2017-01']

              Close     Volume     Open     High      Low
Date
2017-01-31  30.3375  191071040  30.2875  30.3475  30.1550
2017-01-30  30.4075  121308440  30.2325  30.4075  30.1650
2017-01-27  30.4875   81981360  30.5350  30.5875  30.4000
2017-01-26  30.4850  105282960  30.4175  30.6100  30.4000
2017-01-25  30.4700  129669640  30.1050  30.5250  30.0700
2017-01-24  29.9925   92764600  29.8875  30.0250  29.8750
2017-01-23  30.0200   87928000  30.0000  30.2025  29.9425
2017-01-20  30.0000  119690600  30.1125  30.1125  29.9337
2017-01-19  29.9450  102217160  29.8500  30.0225  29.8425
2017-01-18  29.9975   94749400  30.0000  30.1250  29.9275
2017-01-17  30.0000  137648360  29.5850  30.0600  29.5550
2017-01-13  29.7600  104332120  29.7775  29.9050  29.7025
2017-01-12  29.8125  108230200  29.7237  29.8250  29.5525
2017-01-11  29.9375  109812520  29.6850  29.9825  29.6500
2017-01-10  29.7775   97730640  29.6925  29.8450  29.5750
2017-01-09  29.7475  133681160  29.4875  29.8575  29.4850
2017-01-06  29.4775  126859280  29.1950  29.5400  29.1175
2017-01-05  29.1525   88460400  28.9800  29.2160  28.9525
2017-01-04  29.0050   84326480  28.9625  29.1275  28.9375
2017-01-03  29.0375  115076880  28.9500  29.0825  28.6900

# DATE_RANGE FUNCTION

In [16]:
df=pd.read_csv("date_range_data.csv")
df

      Open    High     Low   Close    Volume
0   153.17  153.33  152.22  153.18  16404088
1   153.58  155.45  152.89  155.45  27770715
2   154.34  154.45  153.46  153.93  25331662
3   153.90  155.81  153.78  154.45  26624926
4   155.02  155.98  154.48  155.37  21069647
5   155.25  155.54  154.40  154.99  21250798
6   155.19  155.19  146.02  148.98  64882657
7   145.74  146.09  142.51  145.42  72307330
8   147.16  147.45  145.15  146.59  34165445
9   147.50  147.50  143.84  145.16  31531232
10  143.32  144.48  142.21  144.29  32165373
11  143.78  144.50  142.20  142.27  50361093
12  143.66  146.74  143.66  146.34  32541404
13  146.87  146.87  144.94  145.01  24900073
14  145.52  146.07  144.61  145.87  21265751
15  145.77  146.70  145.12  145.63  19106294
16  145.13  147.16  145.11  146.28  35439389
17  147.17  148.28  145.38  145.82  25692361
18  145.01  146.16  143.62  143.73  24761891
19  144.49  146.11  143.16  145.83  22082432
20  144.71  145.13  142.28  143.68  31499368
21  144.45  144.96  143.78  144.02  23024107

In [17]:
rng = pd.date_range(start="6/1/2016",end="6/30/2016",freq='B')
rng

DatetimeIndex(['2016-06-01', '2016-06-02', '2016-06-03', '2016-06-06',
               '2016-06-07', '2016-06-08', '2016-06-09', '2016-06-10',
               '2016-06-13', '2016-06-14', '2016-06-15', '2016-06-16',
               '2016-06-17', '2016-06-20', '2016-06-21', '2016-06-22',
               '2016-06-23', '2016-06-24', '2016-06-27', '2016-06-28',
               '2016-06-29', '2016-06-30'],
              dtype='datetime64[ns]', freq='B')

In [18]:
df.set_index(rng,inplace=True)

In [19]:
df.index

DatetimeIndex(['2016-06-01', '2016-06-02', '2016-06-03', '2016-06-06',
               '2016-06-07', '2016-06-08', '2016-06-09', '2016-06-10',
               '2016-06-13', '2016-06-14', '2016-06-15', '2016-06-16',
               '2016-06-17', '2016-06-20', '2016-06-21', '2016-06-22',
               '2016-06-23', '2016-06-24', '2016-06-27', '2016-06-28',
               '2016-06-29', '2016-06-30'],
              dtype='datetime64[ns]', freq='B')

# Finding missing dates from datetimeindex

In [20]:
daily_index = pd.date_range(start="6/1/2016",end="6/30/2016",freq='D')
daily_index

DatetimeIndex(['2016-06-01', '2016-06-02', '2016-06-03', '2016-06-04',
               '2016-06-05', '2016-06-06', '2016-06-07', '2016-06-08',
               '2016-06-09', '2016-06-10', '2016-06-11', '2016-06-12',
               '2016-06-13', '2016-06-14', '2016-06-15', '2016-06-16',
               '2016-06-17', '2016-06-18', '2016-06-19', '2016-06-20',
               '2016-06-21', '2016-06-22', '2016-06-23', '2016-06-24',
               '2016-06-25', '2016-06-26', '2016-06-27', '2016-06-28',
               '2016-06-29', '2016-06-30'],
              dtype='datetime64[ns]', freq='D')

In [21]:
daily_index.difference(df.index)

DatetimeIndex(['2016-06-04', '2016-06-05', '2016-06-11', '2016-06-12',
               '2016-06-18', '2016-06-19', '2016-06-25', '2016-06-26'],
              dtype='datetime64[ns]', freq=None)

# generating DatetimeIndex with periods argument

In [119]:
rng = pd.date_range('1/1/2011', periods=72, freq='D')
rng

DatetimeIndex(['2011-01-01', '2011-01-02', '2011-01-03', '2011-01-04',
               '2011-01-05', '2011-01-06', '2011-01-07', '2011-01-08',
               '2011-01-09', '2011-01-10', '2011-01-11', '2011-01-12',
               '2011-01-13', '2011-01-14', '2011-01-15', '2011-01-16',
               '2011-01-17', '2011-01-18', '2011-01-19', '2011-01-20',
               '2011-01-21', '2011-01-22', '2011-01-23', '2011-01-24',
               '2011-01-25', '2011-01-26', '2011-01-27', '2011-01-28',
               '2011-01-29', '2011-01-30', '2011-01-31', '2011-02-01',
               '2011-02-02', '2011-02-03', '2011-02-04', '2011-02-05',
               '2011-02-06', '2011-02-07', '2011-02-08', '2011-02-09',
               '2011-02-10', '2011-02-11', '2011-02-12', '2011-02-13',
               '2011-02-14', '2011-02-15', '2011-02-16', '2011-02-17',
               '2011-02-18', '2011-02-19', '2011-02-20', '2011-02-21',
               '2011-02-22', '2011-02-23', '2011-02-24', '2011-02-25',
               '2011-02-26', '2011-02-27', '2011-02-28', '2011-03-01',
               '2011-03-02', '2011-03-03', '2011-03-04', '2011-03-05',
               '2011-03-06', '2011-03-07', '2011-03-08', '2011-03-09',
               '2011-03-10', '2011-03-11', '2011-03-12', '2011-03-13'],
              dtype='datetime64[ns]', freq='D')

# CUSTOMISED HOLIDAYS

In [22]:
from pandas.tseries.holiday import USFederalHolidayCalendar
from pandas.tseries.offsets import CustomBusinessDay

us_cal = CustomBusinessDay(calendar=USFederalHolidayCalendar())

rng = pd.date_range(start="12/1/2021",end="12/30/2021", freq=us_cal)
rng

DatetimeIndex(['2021-12-01', '2021-12-02', '2021-12-03', '2021-12-06',
               '2021-12-07', '2021-12-08', '2021-12-09', '2021-12-10',
               '2021-12-13', '2021-12-14', '2021-12-15', '2021-12-16',
               '2021-12-17', '2021-12-20', '2021-12-21', '2021-12-22',
               '2021-12-23', '2021-12-27', '2021-12-28', '2021-12-29',
               '2021-12-30'],
              dtype='datetime64[ns]', freq='C')

# Abstract Holiday Calendar

In [23]:
from pandas.tseries.holiday import AbstractHolidayCalendar, nearest_workday, Holiday
class myCalendar(AbstractHolidayCalendar):
    rules = [Holiday('My BirthDay', month=9, day=6),Holiday("openday",month=9,day=2)]     #observance=nearest_workday)
    
holidays = CustomBusinessDay(calendar=myCalendar())
pd.date_range('9/1/2021','9/30/2021',freq=holidays)

DatetimeIndex(['2021-09-01', '2021-09-03', '2021-09-07', '2021-09-08',
               '2021-09-09', '2021-09-10', '2021-09-13', '2021-09-14',
               '2021-09-15', '2021-09-16', '2021-09-17', '2021-09-20',
               '2021-09-21', '2021-09-22', '2021-09-23', '2021-09-24',
               '2021-09-27', '2021-09-28', '2021-09-29', '2021-09-30'],
              dtype='datetime64[ns]', freq='C')

CustomBusinessDay
Weekend in egypt is Friday and Saturday.

Sunday is just a normal weekday and you can handle this custom week schedule using CustomBusinessDay with weekmask as shown below

In [15]:
egypt_weekdays = "Sun Mon Tue Wed Thu"

b = CustomBusinessDay(weekmask=egypt_weekdays)

pd.date_range(start="11/1/2020",periods=20,freq=b)

DatetimeIndex(['2020-11-01', '2020-11-02', '2020-11-03', '2020-11-04',
               '2020-11-05', '2020-11-08', '2020-11-09', '2020-11-10',
               '2020-11-11', '2020-11-12', '2020-11-15', '2020-11-16',
               '2020-11-17', '2020-11-18', '2020-11-19', '2020-11-22',
               '2020-11-23', '2020-11-24', '2020-11-25', '2020-11-26'],
              dtype='datetime64[ns]', freq='C')

You can also add holidays to this custom business day frequency

In [16]:
b = CustomBusinessDay(holidays=['2017-07-04', '2017-07-10'], weekmask=egypt_weekdays)

pd.date_range(start="11/1/2020",periods=20,freq=b)

DatetimeIndex(['2020-11-01', '2020-11-02', '2020-11-03', '2020-11-04',
               '2020-11-05', '2020-11-08', '2020-11-09', '2020-11-10',
               '2020-11-11', '2020-11-12', '2020-11-15', '2020-11-16',
               '2020-11-17', '2020-11-18', '2020-11-19', '2020-11-22',
               '2020-11-23', '2020-11-24', '2020-11-25', '2020-11-26'],
              dtype='datetime64[ns]', freq='C')

# FORMATTING OF DATES

In [18]:
dates = ['2017-01-05', 'Jan 5, 2017', '01/05/2017', '2017.01.05', '2017/01/05','20170105']
pd.to_datetime(dates)

DatetimeIndex(['2017-01-05', '2017-01-05', '2017-01-05', '2017-01-05',
               '2017-01-05', '2017-01-05'],
              dtype='datetime64[ns]', freq=None)

In [19]:
dt = ['2017-01-05 2:30:00 PM', 'Jan 5, 2017 14:30:00', '01/05/2016', '2017.01.05', '2017/01/05','20170105']
pd.to_datetime(dt)

DatetimeIndex(['2017-01-05 14:30:00', '2017-01-05 14:30:00',
               '2016-01-05 00:00:00', '2017-01-05 00:00:00',
               '2017-01-05 00:00:00', '2017-01-05 00:00:00'],
              dtype='datetime64[ns]', freq=None)

# European style dates with day first

EUROPEAN STYLE = "DD/MM/YY"

AMERICAN STYLE = "MM/DD/YY"

In [131]:
pd.to_datetime('5-1-2016')

Timestamp('2016-05-01 00:00:00')

In [132]:
pd.to_datetime('5-1-2016', dayfirst=True)

Timestamp('2016-01-05 00:00:00')

Custom date time format

In [133]:
pd.to_datetime('2017$01$05', format='%Y$%m$%d')

pd.to_datetime('2017#01#05', format='%Y#%m#%d')

Timestamp('2017-01-05 00:00:00')

Handling invalid dates

In [224]:
pd.to_datetime(['2017-01-05', 'Jan 6, 2017', 'abc'])

ParserError: Unknown string format: abc

In [25]:
pd.to_datetime(['2017-01-05', 'Jan 6, 2017', 'abc'], errors='ignore')

Index(['2017-01-05', 'Jan 6, 2017', 'abc'], dtype='object')

In [26]:
pd.to_datetime(['2017-01-05', 'Jan 6, 2017', 'abc'], errors='coerce')

DatetimeIndex(['2017-01-05', '2017-01-06', 'NaT'], dtype='datetime64[ns]', freq=None)

# PeriodIndex and period_range

In [55]:
r = pd.period_range('2011', '2012', freq='q')
r

PeriodIndex(['2011Q1', '2011Q2', '2011Q3', '2011Q4', '2012Q1'], dtype='period[Q-DEC]')

In [51]:
r[4].start_time

Timestamp('2012-01-01 00:00:00')

In [52]:
r[4].end_time

Timestamp('2012-03-31 23:59:59.999999999')

In [56]:
r = pd.period_range('2011', '2012', freq='q-jan')
r

PeriodIndex(['2011Q4', '2012Q1', '2012Q2', '2012Q3', '2012Q4'], dtype='period[Q-JAN]')

In [57]:
r[0].start_time

Timestamp('2010-11-01 00:00:00')

In [58]:
r[0].end_time

Timestamp('2011-01-31 23:59:59.999999999')

# Add start date end date columns to dataframe

In [59]:
df=pd.read_csv('walmart_periodindex_data.csv')
df

  Line Item  2017Q1  2017Q2  2017Q3  2017Q4  2018Q1
0   Revenue  115904  120854  118179  130936  117542
1  Expenses   86544   89485   87484   97743   87688
2    Profit   29360   31369   30695   33193   29854

In [60]:
df.set_index("Line Item",inplace=True)

In [61]:
df=df.T
df

Line Item  Revenue  Expenses  Profit
2017Q1      115904     86544   29360
2017Q2      120854     89485   31369
2017Q3      118179     87484   30695
2017Q4      130936     97743   33193
2018Q1      117542     87688   29854

In [62]:
df.index = pd.PeriodIndex(df.index, freq="Q-JAN")
df

Line Item  Revenue  Expenses  Profit
2017Q1      115904     86544   29360
2017Q2      120854     89485   31369
2017Q3      118179     87484   30695
2017Q4      130936     97743   33193
2018Q1      117542     87688   29854

In [63]:
df["Start Date"]=df.index.map(lambda x: x.start_time)
df

Line Item  Revenue  Expenses  Profit Start Date
2017Q1      115904     86544   29360 2016-02-01
2017Q2      120854     89485   31369 2016-05-01
2017Q3      118179     87484   30695 2016-08-01
2017Q4      130936     97743   33193 2016-11-01
2018Q1      117542     87688   29854 2017-02-01

In [64]:
df["End Date"]=df.index.map(lambda x: x.end_time)
df

Line Item  Revenue  Expenses  Profit Start Date                      End Date
2017Q1      115904     86544   29360 2016-02-01 2016-04-30 23:59:59.999999999
2017Q2      120854     89485   31369 2016-05-01 2016-07-31 23:59:59.999999999
2017Q3      118179     87484   30695 2016-08-01 2016-10-31 23:59:59.999999999
2017Q4      130936     97743   33193 2016-11-01 2017-01-31 23:59:59.999999999
2018Q1      117542     87688   29854 2017-02-01 2017-04-30 23:59:59.999999999